import * as yup from 'yup';

const validationSchema = yup.object({
  firstName: yup
    .string(`Введіть ваше ім'я`)
    .min(2, `Ім'я має складатись мінімум з 2 символів`)
    .matches(/^[A-Za-zА-Яа-яєі ]*$/, `Ім'я має включати лише букви`)
    .max(40, `У імені може бути максимум 40 символів`)
    .required(`Необхідно обов'язково вказати ім'я`),
  lastName: yup
    .string('Введіть ваше прізвище')
    .min(2, `Прізвище має складатись мінімум з 2 символів`)
    .matches(/^[A-Za-zА-Яа-яєі ]*$/, `Прізвище має включати лише букви`)
    .max(40, `У прізвищі може бути максимум 40 символів`)
    .required(`Необхідно обов'язково вказати прізвище`),
  email: yup
    .string('Введіть вашу пошту')
    .email('Введіть коректну пошту')
    .required(`Необхідно обов'язково вказати пошту`),
  password: yup
    .string('Введіть пароль')
    .min(8, 'Пароль має містити як мінімум 8 символів')
    .required(`Необхідно обов'язково вказати пароль`),
  passwordConfirmation: yup
    .string('Введіть повторно ваш пароль')
    .oneOf([yup.ref('password'), null], 'Паролі не співпадають')
    .required(`Необхідно обов'язково повторити пароль`),
});

export default validationSchema;
