import * as yup from 'yup';

const validationSchema = yup.object({
  firstName: yup
    .string(`Введіть ваше ім'я`)
    .min(2, `Ім'я має складатись мінімум з 2 символів`)
    .matches(/^[A-Za-zА-Яа-яєі ]*$/, `Ім'я має включати лише букви`)
    .max(40, `У імені може бути максимум 40 символів`)
    .required(`Необхідно обов'язково вказати ім'я`),
  lastName: yup
    .string('Введіть ваше прізвище')
    .min(2, `Прізвище має складатись мінімум з 2 символів`)
    .matches(/^[A-Za-zА-Яа-яєі ]*$/, `Прізвище має включати лише букви`)
    .max(40, `У прізвищі може бути максимум 40 символів`)
    .required(`Необхідно обов'язково вказати прізвище`),
  postalAddress: yup
    .string('Введіть вашу адресу')
    .min(5, 'Адреса має містити як мінімум 5 символів'),
  postcode: yup
    .string('Введіть ваш поштовий код')
    .min(5, 'Поштовий код має містити як мінімум 5 символів'),
});

export default validationSchema;
