import * as yup from 'yup';

const validationSchema = yup.object({
  name: yup
    .string(`Введіть назву книги`)
    .min(3, `Назва має складатись мінімум з 3 символів`)
    .required(`Необхідно обов'язково вказати назву`),
  ISBN: yup
    .string('Введіть ISBN')
    .min(5, 'ISBN має містити як мінімум 5 символів')
    .required(`Необхідно обов'язково вказати ISBN`),
  authors: yup
    .string('Вкажіть авторів книги')
    .min(3, 'ПІБ автора має містити як мінімум 3 символів')
    .required(`Необхідно обов'язково вказати автора`),
  yearPublished: yup
    .string('Вкажіть рік друку')
    .required(`Необхідно обов'язково вказати рік друку`),
  placePublished: yup
    .string(`Вкажіть місто друку книги`)
    .min(3, `Місто друку має складатись мінімум з 5 символів`)
    .required(`Необхідно обов'язково вказати автора`),
  issuer: yup
    .string('Введіть видавця книги')
    .min(3, 'Назва видавця має містити як мінімум 3 символів')
    .required(`Необхідно обов'язково вказати видавця книги`),
  countPages: yup
    .string('Введіть кількість сторінок у книзі')
    .required(`Необхідно обов'язково вказати кількість сторінок у книзі`),
  keywords: yup
    .string(`Вкажіть ключові слова книги`)
    .min(3, `Ключові слова мають складатись мінімум з 3 символів`),
  languageISO: yup
    .string('Введіть мову книги')
    .required(`Необхідно обов'язково вказати мову книги`),
  type: yup
    .string('Введіть тип книги')
    .required(`Необхідно обов'язково вказати тип книги`),
  imageURL: yup.string(`Завантажте обложку книги`),
  abstract: yup
    .string(`Введіть опис книги`)
    .min(5, `Опис має складатись мінімум з 5 символів`),
});

export default validationSchema;
